Tekla.Structures.Model.ControlLine
The ControlLine class defines a user defined (possibly magnetic) line helping in modeling work.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ControlLine controlLine = new ControlLine();
LineSegment line = new LineSegment();
line.Point1 = new Point(6000,6000,0);
line.Point2 = new Point(6000,12000,0);
controlLine.Line = line;
controlLine.IsMagnetic = true;
bool Result = false;
Result = controlLine.Insert();
}
}

Tekla.Structures.Model.ControlLine.Line
The line segment defining the position of the control line.

Tekla.Structures.Model.ControlLine.IsMagnetic
Determines whether the line is magnetic or not.

Tekla.Structures.Model.ControlLine.Extension
The extension of the control line.

Tekla.Structures.Model.ControlLine.Color
The color of the control line.

Tekla.Structures.Model.ControlLine.LineType
The line type of the control line.

Tekla.Structures.Model.ControlLine.#ctor
Creates a new control line instance.
The default values are as follows:
Line = new LineSegment();
IsMagnetic = false;
Color = ControlLineColorEnum.YELLOW;
Extension = 0.0;

Tekla.Structures.Model.ControlLine.#ctor(Tekla.Structures.Geometry3d.LineSegment,System.Boolean)
Creates a new control line instance taking the line segment and magnetism as input.
Line: The line segment to be used.
IsMagnetic: Determines whether the line is magnetic or not.

Tekla.Structures.Model.ControlLine.Insert
Inserts the control line into the model.
Returns: True on success.

Tekla.Structures.Model.ControlLine.Select
Selects the control line with the given Identifier.
Returns: True on success.

Tekla.Structures.Model.ControlLine.Modify
Modifies the control line with the given Identifier.
Returns: True on success.

Tekla.Structures.Model.ControlLine.Delete
Deletes the control line with the given Identifier.
Returns: True on success.